Tekla.Structures.Analysis.AnalysisModelIssue
Analysis model issue (error, warning, information)

Tekla.Structures.Analysis.AnalysisModelIssue.Severity
Gets or sets the issue severity

Tekla.Structures.Analysis.AnalysisModelIssue.Type
Gets or sets the issue type

Tekla.Structures.Analysis.AnalysisModelIssue.Description
Gets or sets the description of the issue, translated to the current language

Tekla.Structures.Analysis.AnalysisModelIssue.Details
Gets or sets the details of the issue, translated to the current language

Tekla.Structures.Analysis.AnalysisModelIssue.AnalysisObjects
Gets or sets the analysis objects of the issue

Tekla.Structures.Analysis.AnalysisModelIssue.ModelObjects
Gets or sets the model objects of the issue

Tekla.Structures.Analysis.AnalysisModelIssue.Positions
Gets or sets the positions of the issue

Tekla.Structures.Analysis.AnalysisModelIssue.GetAnalysisModelIssues(Tekla.Structures.Analysis.AnalysisModel)
Get analysis model issues.
analysisModel: The analysis model.
Returns: The analysis model issues.